mistyk/inavradar-ESP32/src/main.cpp
  Command* config = new Command("config", [](Cmd* cmd) {
    String arg1 = cmd->getValue(0);
    String arg2 = cmd->getValue(1);
    if (arg1 == "") cliConfig(cNum);
    if (arg1 == "loraFreq") {
      if ( arg2.toInt() == 433E6 || arg2.toInt() == 868E6 || arg2.toInt() == 915E6) {
        cfg.loraFrequency = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora frequency changed!");
      } else {
        serialConsole[cNum]->println("Lora frequency not correct: 433000000, 868000000, 915000000");
      }
    }
    if (arg1 == "loraBandwidth") {
      if (arg2.toInt() == 250000 || arg2.toInt() == 62500 || arg2.toInt() == 7800) {
        cfg.loraBandwidth = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora bandwidth changed!");
      } else {
        serialConsole[cNum]->println("Lora bandwidth not correct: 250000, 62500, 7800");
      }
    }
    if (arg1 == "loraSpread") {
    if (arg2.toInt() >= 7 && arg2.toInt() <= 12) {
        cfg.loraSpreadingFactor = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora spreading factor changed!");
      } else {
        serialConsole[cNum]->println("Lora Lora spreading factor not correct: 7 - 12");
      }
    }
    if (arg1 == "loraAddress") {
      if (arg2.toInt() >= 1 && arg2.toInt() <= 250) {
        cfg.loraAddress = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora address changed!");
      } else {
        serialConsole[cNum]->println("Lora address not correct: 1 - 250");
      }
    }
    if (arg1 == "uavtimeout") {
      if (arg2.toInt() >= 5 && arg2.toInt() <= 600) {
        cfg.uavTimeout = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("UAV timeout changed!");
      } else {
        serialConsole[cNum]->println("UAV timeout not correct: 5 - 600");
      }
    }
  });
  config->addArg(new AnonymOptArg(""));
  config->addArg(new AnonymOptArg(""));

  cli->addCmd(config);
  //cli->parse("ping");
  //cli->parse("hello");
}
// ----------------------------------------------------------------------------- LoRa
void sendMessage(planeData *outgoing) {
  while (!LoRa.beginPacket()) {  }
  LoRa.write((uint8_t*)outgoing, sizeof(fakepd));
  LoRa.endPacket(false);
}

void onReceive(int packetSize) {
  if (packetSize == 0) return;
  LoRa.readBytes((uint8_t *)&loraMsg, packetSize);
  //cliLog(loraMsg.header);
  //cliLog(cfg.loraHeader);
  if (String(loraMsg.header) == String(cfg.loraHeader)) { // new plane data
      //rssi = String(LoRa.packetRssi());
      loraRX = 1;
      pdIn = loraMsg;
      cliLog("New air packet");
      bool found = 0;
      int free = -1;
      for (size_t i = 0; i <= 4; i++) {
        if (String(pds[i].pd.planeName) == String(pdIn.planeName) ) { // update plane
          pds[i].pd = pdIn;
          pds[i].rssi = LoRa.packetRssi();
          pds[i].pd.state = 1;
          pds[i].waypointNumber = i+1;
          pds[i].lastUpdate = millis();
          found = 1;
          cliLog("UAV DB update POI #" + String(i+1));
          break;
        }
        if (free == -1 && pds[i].waypointNumber == 0) free = i; // find free slot
      }
      if (!found) { // if not there put it in free slot
          pds[free].waypointNumber = free+1;
          pds[free].pd = pdIn;
          pds[free].pd.state = 1;
          pds[free].lastUpdate = millis();
          cliLog("UAV DB new POI #" + String(free+1));
          free = 0;
      }
  }
}
int moving = 0;
void sendFakePlanes () {
  if (cfg.debugFakeMoving && moving > 100) {
    moving = 0;
  } else {
    if (!cfg.debugFakeMoving) moving = 0;
  }
  cliLog("Sending fake UAVs via radio ...");
  String("ADS-RC").toCharArray(fakepd.header,7);
  fakepd.loraAddress = (char)5;
  String("Testplane #1").toCharArray(fakepd.planeName,20);
  fakepd.state=  1;
//  fakepd.gps.lat = homepos.lat + (10 * moving);
//  fakepd.gps.lon = homepos.lon;
  fakepd.gps.alt = 300;
  fakepd.gps.groundSpeed = 450;
  //sendMessage(&fakepd);
  //delay(300);
  /*
  fakepd.loraAddress = (char)2;
  String("Testplane #2").toCharArray(fakepd.planeName,20);
  fakepd.armState=  1; */
  // -------------------------------------------------------- fixed GPS pos radio fake planes

  fakepd.gps.lat = 50.100400 * 10000000; // + (500 * moving);
  fakepd.gps.lon = 8.762835 * 10000000;
  sendMessage(&fakepd);
  // 50.088233, 8.782278 ... 50.088233, 8.785693 ... 341 * 100
  // 50.100400, 8.762835
  // 50.101938, 8.812962 - bieber
  // 47.345446, -1.543392
  /*
  delay(300);
  fakepd.loraAddress = (char)3;
  String("Testplane #3").toCharArray(fakepd.planeName,20);
  fakepd.gps.alt = 500;
  fakepd.armState=  1;
  fakepd.gps.lat = 50.088233 * 10000000;
  fakepd.gps.lon = 8.782278 * 10000000 + (341 * moving);
  sendMessage(&fakepd);
  delay(300);
  fakepd.loraAddress = (char)4;
  String("Testplane #4").toCharArray(fakepd.planeName,20);
  fakepd.armState=  1;
  fakepd.gps.lat = 50.088233 * 10000000;
  fakepd.gps.lon = 8.782278 * 10000000 + (600 * moving);
  fakepd.gps.alt = 500;
  sendMessage(&fakepd);
  delay(300);
  fakepd.loraAddress = (char)5;
  String("Testplane #5").toCharArray(fakepd.planeName,20);
  fakepd.armState=  1;
  fakepd.gps.lat = 50.1006770 * 10000000 + (1000 * moving);
  fakepd.gps.lon = 8.762406 * 10000000;
  sendMessage(&fakepd);
  delay(300);
*/
  cliLog("Fake UAVs sent.");
  moving++;
}
void initLora() {
	display.drawString (0, 8, "LORA");
  display.display();
  cliLog("Starting radio ...");
  pd.loraAddress = cfg.loraAddress;
  String(cfg.loraHeader).toCharArray(pd.header,7);
  SPI.begin(5, 19, 27, 18);
  LoRa.setPins(SS,RST,DI0);
  if (!LoRa.begin(cfg.loraFrequency)) {
    cliLog("Radio start failed!");
    display.drawString (94, 8, "FAIL");
    while (1);
  }
  LoRa.sleep();
  LoRa.setSignalBandwidth(cfg.loraBandwidth);
  LoRa.setCodingRate4(cfg.loraCodingRate4);
  LoRa.setSpreadingFactor(cfg.loraSpreadingFactor);
  LoRa.idle();
  LoRa.onReceive(onReceive);
  LoRa.enableCrc();
  LoRa.receive();
  cliLog("Radio started.");
  display.drawString (100, 8, "OK");
  display.display();
}
// ----------------------------------------------------------------------------- Display
void drawDisplay () {
  display.clear();
  if (displayPage == 0) {
    display.setFont (ArialMT_Plain_24);
    display.setTextAlignment (TEXT_ALIGN_RIGHT);
    display.drawString (30,5, String(pd.gps.numSat));
    display.drawString (30,30, String(numPlanes));
    display.drawString (114,5, String((float)fcanalog.vbat/10));
    display.drawString (114,30, rssi);
    display.setFont (ArialMT_Plain_10);
    display.setTextAlignment (TEXT_ALIGN_LEFT);
    //if (pd.gps.fixType == 0) display.drawString (33,7, "NF");
    if (pd.gps.fixType == 1) display.drawString (33,7, "2D");
    if (pd.gps.fixType == 2) display.drawString (33,7, "3D");
    display.drawString (33,16, "SAT");
    display.drawString (33,42, "UAV");
    display.drawString (116,16, "V");
    display.drawString (116,42, "dB");
    if (String(planeFC) == String("No FC")) {
      if (cfg.debugOutput) {
        if (cfg.debugFakeWPs) display.drawString (0,54, "LFP");
        if (cfg.debugFakePlanes) display.drawString (30,54, "RFP");
        if (cfg.debugFakeMoving) display.drawString (60,54, "MFP");
      }
    } else {
      //if (bitRead(fcstatusex.armingFlags,17) == 0) display.drawString (0,54, "RC LINK LOST");
      //else
      display.drawString (0,54, pd.planeName);
      if (fcstatusex.armingFlags != 0) display.drawXbm(61, 54, 8, 8, warnSymbol);
    }
    display.drawString (84,54, "TX");
    display.drawString (106,54, "RX");
    display.drawXbm(98, 55, 8, 8, loraTX ? activeSymbol : inactiveSymbol);
    display.drawXbm(120, 55, 8, 8, loraRX ? activeSymbol : inactiveSymbol);

