mistyk/inavradar-ESP32/src/main.cpp
  }
  if (displayPage == 1) {
    if (numPlanes == 0) display.drawString (0,0, "no UAVs detected ...");
    else {
      display.setFont (ArialMT_Plain_10);
      for (size_t i = 0; i <=2 ; i++) {
        if (pds[i].waypointNumber != 0) {
          display.setTextAlignment (TEXT_ALIGN_LEFT);
          display.drawString (0,i*16, pds[i].pd.planeName);
          display.drawString (0,8+i*16, "RSSI " + String(pds[i].rssi));
          display.setTextAlignment (TEXT_ALIGN_RIGHT);
          display.drawString (128,i*16, String((float)pds[i].pd.gps.lat/10000000,6));
          display.drawString (128,8+i*16, String((float)pds[i].pd.gps.lon/10000000,6));
        }
      }
    }
  }
  if (displayPage == 2) {
    display.setFont (ArialMT_Plain_10);
    for (size_t i = 0; i <=1 ; i++) {
      if (pds[i].waypointNumber != 0) {
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (0,i*16, pds[i+3].pd.planeName);
        display.drawString (0,8+i*16, "RSSI " + String(pds[i].rssi));
        display.setTextAlignment (TEXT_ALIGN_RIGHT);
        display.drawString (65,i*16, String((float)pds[i+3].pd.gps.lat/10000000,6));
        display.drawString (65,8+i*16, String((float)pds[i+3].pd.gps.lon/10000000,6));
      }
    }
  }

  /* old display
  display.setFont (ArialMT_Plain_10);
  display.setTextAlignment (TEXT_ALIGN_LEFT);
  display.drawString (0,54, pd.armState ? "Armed" : "Disarmed");
  display.drawString (48,54, String(pd.gps.numSat) + " Sat");
  display.drawString (84,54, "TX");
  display.drawString (106,54, "RX");

  display.drawXbm(98, 55, 8, 8, loraTX ? activeSymbol : inactiveSymbol);
  display.drawXbm(120, 55, 8, 8, loraRX ? activeSymbol : inactiveSymbol);

  for (size_t i = 0; i <=4 ; i++) {
    if (pds[i].waypointNumber != 0) {
      display.drawString (0,i*8, pds[i].pd.planeName);
      display.drawString (80,i*8,String(pds[i].distance));
    }
  }
  */

  display.display();
}

void initDisplay () {
  cliLog("Starting display ...");
  pinMode (16, OUTPUT);
  pinMode (2, OUTPUT);
  digitalWrite (16, LOW); // set GPIO16 low to reset OLED
  delay (50);
  digitalWrite (16, HIGH); // while OLED is running, GPIO16 must go high
  display.init ();
  display.flipScreenVertically ();
  display.setFont (ArialMT_Plain_10);
  display.setTextAlignment (TEXT_ALIGN_LEFT);
  display.drawString (0, 0, "DISPLAY");
  display.drawString (100, 0, "OK");
  display.display();
  cliLog("Display started!");
}
// ----------------------------------------------------------------------------- MSP and FC
void getPlanetArmed () {
  uint32_t planeModes;
  msp.getActiveModes(&planeModes);
  //Serial.print("Arm State: ");
  //Serial.println(bitRead(planeModes,0));
  pd.state = bitRead(planeModes,0);
}

void getPlaneGPS () {
  if (msp.request(MSP_RAW_GPS, &pd.gps, sizeof(pd.gps))) {
  }
}

void getPlaneBat () {
  if (msp.request(MSP_ANALOG, &fcanalog, sizeof(fcanalog))) {
    //cliLog(String(fcanalog.vbat));
  }
}
void getPlaneStatusEx () {
  if (msp.request(MSP_STATUS_EX, &fcstatusex, sizeof(fcstatusex))) {
    cliLog(String(bitRead(fcstatusex.armingFlags,18)));
    //cliLog(String(fcanalog.vbat));
  }
}
void getPlaneData () {
  String("No Name").toCharArray(pd.planeName,20);
  String("No FC").toCharArray(planeFC,20);
  if (msp.request(10, &pd.planeName, sizeof(pd.planeName))) {
    //Serial.println(pd.planeName);
  }
  if (msp.request(2, &planeFC, sizeof(planeFC))) {
    //Serial.println(planeFC);
  }
}

void planeSetWP () {
  msp_set_wp_t wp;
  for (size_t i = 0; i <= 4; i++) {
    if (pds[i].waypointNumber != 0) {
      wp.waypointNumber = pds[i].waypointNumber;
      wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
      wp.lat = pds[i].pd.gps.lat;
      wp.lon = pds[i].pd.gps.lon;
      wp.alt = pds[i].pd.gps.alt;
      wp.p1 = pds[i].pd.gps.groundSpeed;
      cliLog("P1:" + String(wp.p1));
      wp.p2 = 0;
      wp.p3 = pds[i].pd.state;
      cliLog("P3:" + String(wp.p3));
      if (i == 4 || pds[i+1].waypointNumber==0) {
        wp.flag = 0xa5;
        cliLog("last flag - POI #" + String(wp.waypointNumber));
      }
      else wp.flag = 0;
      msp.command(MSP_SET_WP, &wp, sizeof(wp));
      cliLog("Sent to FC - POI #" + String(wp.waypointNumber));
    }
    //else break;
  }
  //cliLog("POIs sent to FC.");
  //msp.command(MSP_SET_WP, &wp, sizeof(wp));
}
void planeFakeWPv2 () {
  msp_raw_planes_t wp;
  wp.id = 1;
  wp.arm_state = 1;
  wp.lat = 50.1006770 * 10000000;
  wp.lon = 8.7613380 * 10000000;
  wp.alt = 100;
  wp.heading = 0;
  wp.speed = 0;
  wp.callsign0 = 'D';
  wp.callsign1 = 'A';
  wp.callsign2 = 'N';
  msp.commandv2(MSP2_ESP32, &wp, sizeof(wp));
}

void planeFakeWP () {
    msp_set_wp_t wp;
    if (cfg.debugFakeMoving && moving > 100) {
      moving = 0;
    } else {
      moving = 0;
    }
/*    wp.waypointNumber = 1;
    wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
    wp.lat = 50.1006770 * 10000000;
    wp.lon = 8.7613380 * 10000000;
    wp.alt = 100;
    wp.p1 = 200;
    wp.p2 = 0;
    wp.p3 = 0;
    wp.flag = 0;
    msp.command(MSP_SET_WP, &wp, sizeof(wp));
    wp.waypointNumber = 2;
    wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
    wp.lat = 50.1020320 * 10000000;
    wp.lon = 8.7615830 * 10000000;
    wp.alt = 200;
    wp.p1 = 100;
    wp.p2 = 0;
    wp.p3 = 0;
    wp.flag = 0;
    msp.command(MSP_SET_WP, &wp, sizeof(wp));
    wp.waypointNumber = 3;
    wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
    wp.lat = 50.102137 * 10000000;
    wp.lon = 8.762990 * 10000000;
    wp.alt = 300;
    wp.p1 = 0;
    wp.p2 = 0;
    wp.p3 = 0;
    wp.flag = 0;
    msp.command(MSP_SET_WP, &wp, sizeof(wp));
    wp.waypointNumber = 4;
    wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
    wp.lat = 50.100547 * 10000000;
    wp.lon = 8.764052 * 10000000;
    wp.alt = 0;
    wp.p1 = 500;
    wp.p2 = 0;
    wp.p3 = 0;
    wp.flag = 0;
    msp.command(MSP_SET_WP, &wp, sizeof(wp));
*/

    if (pd.gps.fixType > 0) {
      wp.waypointNumber = 1;
      wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
      wp.lat = homepos.lat-100 + (moving * 20);
      wp.lon = homepos.lon;
      wp.alt = homepos.alt + 300;
      wp.p1 = 1000;
      wp.p2 = 0;
      wp.p3 = 1;
      wp.flag = 0xa5;
      msp.command(MSP_SET_WP, &wp, sizeof(wp));
      cliLog("Fake POIs sent to FC.");
    } else {
      cliLog("Fake POIs waiting for GPS fix.");
    }
}

void initMSP () {
  cliLog("Starting MSP ...");
  display.drawString (0, 16, "MSP ");
  display.display();
  delay(200);
  Serial1.begin(115200, SERIAL_8N1, cfg.mspRX , cfg.mspTX);
  msp.begin(Serial1);
  cliLog("MSP started!");
  display.drawString (100, 16, "OK");
  display.display();
  display.drawString (0, 24, "FC ");
  display.display();
  cliLog("Waiting for FC to start ...");
  delay(2000);
  getPlaneData();
  //getPlanetArmed();
  getPlaneGPS();
  cliLog("FC detected: " + String(planeFC));
  display.drawString (100, 24, planeFC);
  display.display();
}
// ----------------------------------------------------------------------------- main init

