mistyk/inavradar-ESP32/src/main.cpp
const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
  portENTER_CRITICAL_ISR(&mux);
  if (buttonPressed == 0) {
    buttonPressed = 1;
    if (displayPage >= 1) displayPage = 0;
    else displayPage++;
    //drawDisplay();
    lastDebounceTime = millis();
  }
  portEXIT_CRITICAL_ISR(&mux);
}


void setup() {

/*  cli.RegisterCmd("status",&cliStatus);
  cli.RegisterCmd("help",&cliHelp);
  cli.RegisterCmd("config",&cliConfig);
  cli.RegisterCmd("debug",&cliDebug);
  cli.RegisterCmd("reboot",&cliReboot); */

  Serial.begin(115200);
  serialConsole[0] = &Serial;
  initCli();
  initConfig();
  initDisplay();
  initLora();
  delay(1500);
  initMSP();
  delay(1000);
  //wifisetup();
  pinMode(interruptPin, INPUT);
  buttonPressed = 0;
  attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);

  for (size_t i = 0; i <= 4; i++) {
    pds[i].pd.loraAddress= 0x00;
    pds[i].waypointNumber = 0;
  }
  booted = 1;
  serialConsole[0]->print("> ");
}

// ----------------------------------------------------------------------------- main loop
void loop() {

  if ( (millis() - lastDebounceTime) > 150 && buttonPressed == 1) buttonPressed = 0;

  if (millis() - displayLastTime > cfg.intervalDisplay) {
    drawDisplay();
    readCli();

    loraTX = 0;
    loraRX = 0;
    displayLastTime = millis();
  }

  if (millis() - pdLastTime > cfg.intervalStatus) {
    numPlanes = 0;
    for (size_t i = 0; i <= 4; i++) {
      if (pds[i].waypointNumber != 0) numPlanes++;
      if (pd.gps.fixType != 0) pds[i].distance = distanceEarth(pd.gps.lat/10000000, pd.gps.lon/10000000, pds[i].pd.gps.lat/10000000, pds[i].pd.gps.lon/10000000);
      if (pds[i].pd.loraAddress != 0 && millis() - pds[i].lastUpdate > cfg.uavTimeout*1000 ) { // plane timeout
        //pds[i].pd.gps.lat = 0;
        //pds[i].pd.gps.lon = 0;
        //pds[i].pd.gps.alt = 0;
        pds[i].pd.state = 2;
        planeSetWP();
        planeSetWP();
        pds[i].waypointNumber = 0;
        pds[i].pd.loraAddress = 0;
        rssi = "0";
        String("").toCharArray(pds[i].pd.planeName,20);
        cliLog("UAV DB delete POI #" + String(i+1));
      }
    }
    getPlaneStatusEx();
    //dalternate = !dalternate;
    if (String(pd.planeName) != "No Name" ) {
      getPlaneData();
      getPlanetArmed();
      getPlaneBat();
      if (!pd.state) {
        getPlaneGPS();

      }
    }

    if (!pd.state) {
      if (pd.gps.fixType != 0) {
        homepos = pd.gps;
        sendMessage(&pd);
        loraTX = 1;
      }
      LoRa.receive();
    }
    pdLastTime = millis();
  }

  if ((millis() - sendLastTime) > cfg.intervalSend ) {
    sendLastTime = millis()+ random(0, 50);

    if (pd.state) {
      getPlaneGPS();
      loraTX = 1;
      if (pd.gps.fixType != 0) sendMessage(&pd);
      LoRa.receive();
    }
    if (cfg.debugFakePlanes) {
      sendFakePlanes();
      loraTX = 1;
    }
    //if (pd.armState) planeSetWP();
    planeSetWP();
    if (cfg.debugFakeWPs) planeFakeWP();
    //planeFakeWPv2();
  }
}
